----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             768
       BatchNorm2d-2           [-1, 16, 32, 32]              32
            Conv2d-3           [-1, 32, 16, 16]           8,192
       BatchNorm2d-4           [-1, 32, 16, 16]              64
            Conv2d-5             [-1, 64, 8, 8]          32,768
       BatchNorm2d-6             [-1, 64, 8, 8]             128
            Conv2d-7            [-1, 128, 4, 4]         131,072
       BatchNorm2d-8            [-1, 128, 4, 4]             256
            Conv2d-9            [-1, 256, 2, 2]         524,288
      BatchNorm2d-10            [-1, 256, 2, 2]             512
           Conv2d-11            [-1, 512, 2, 2]       1,179,648
      BatchNorm2d-12            [-1, 512, 2, 2]           1,024
          Flatten-13                  [-1, 512]               0
           Linear-14                   [-1, 32]          16,416
      ConvEncoder-15                   [-1, 32]               0
           Linear-16                  [-1, 512]          16,896
        Unflatten-17            [-1, 512, 1, 1]               0
  ConvTranspose2d-18            [-1, 256, 2, 2]       2,097,152
      BatchNorm2d-19            [-1, 256, 2, 2]             512
  ConvTranspose2d-20            [-1, 128, 4, 4]         524,288
      BatchNorm2d-21            [-1, 128, 4, 4]             256
  ConvTranspose2d-22             [-1, 64, 8, 8]         131,072
      BatchNorm2d-23             [-1, 64, 8, 8]             128
  ConvTranspose2d-24           [-1, 32, 16, 16]          32,768
      BatchNorm2d-25           [-1, 32, 16, 16]              64
  ConvTranspose2d-26           [-1, 16, 32, 32]           8,192
      BatchNorm2d-27           [-1, 16, 32, 32]              32
  ConvTranspose2d-28            [-1, 3, 64, 64]             771
      ConvDecoder-29            [-1, 3, 64, 64]               0
================================================================
Total params: 4,707,299
Trainable params: 4,707,299
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.05
Forward/backward pass size (MB): 1.20
Params size (MB): 17.96
Estimated Total Size (MB): 19.20
----------------------------------------------------------------
